//******************************************************************************
//
//
//      シーン管理
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "all.h"

//==============================================================================
//
//      Sceneクラス
//
//==============================================================================

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
Scene* Scene::execute()
{
    using namespace GameLib;

    // 初期化処理
    init();
    audio_init();
    ShowCursor(false);

    // ゲームループ
    while (GameLib::gameLoop(false))    // falseをtrueにするとタイトルバーにフレームレート表示
    {
        // 入力処理
        input::update();

        // 更新処理
        update();
        music::update();


        // 描画処理
        draw();

        // デバッグ文字列の描画
        //debug::display(0, 0, 0, 1, 1);
        //debug::setString("GP2_12 SAMPLE");

        // 画面フリップ
        GameLib::present(1, 0);

        // 終了チェック
        if (nextScene_) break;
    }
    audio_deinit();


    // 終了処理
    deinit();

    return nextScene_;	// 次のシーンを返す
}

//******************************************************************************
//
//      SceneManagerクラス
//
//******************************************************************************

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
void SceneManager::execute(Scene* scene)
{
    using namespace GameLib;

    bool isFullScreen = true;	// フルスクリーンにするならtrueに変える
                                //（Releaseモードのみ）

    //TODO:タイトルの名前を変える
    // ゲームライブラリの初期化処理
    GameLib::init(L"Paper Island", BG::WINDOW_W, BG::WINDOW_H, isFullScreen);

#ifndef _DEBUG
    ShowCursor(!isFullScreen);	// フルスクリーン時はカーソルを消す
#endif

    // メインループ
    while (scene)
    {
        scene = scene->execute();
    }

    // ゲームライブラリの終了処理
    GameLib::uninit();
}

//******************************************************************************
